ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/system.c

#include <stdlib.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_drv_twi.h"
#include "nrfx_twi.h"
#include "nrfx_twim.h"
#include "nrf_drv_spi.h"
#include "oled.h"
#include "ssd1351.h" 
#include "fonts.h" 
#include "button.h" 
#include "system.h"
#include "flash.h"


#define SYS_ system_singleton->
#define L_ list_singleton->
#define REC_ recents_singleton-> 


recents_struct* recents_singleton;
list_struct* list_singleton;
system_struct* system_singleton; 


//NOTE NOT USED 
uint8_t projectIterator = 0; 
uint8_t chipIterator = 0; 
uint8_t fileIterator = 0;

uint8_t selectedProject; 
 

// Hardcoded Values
char systemFirmware[] = {"FlashBlaster V0"}; 
char splashHeader[] = {"Select:"}; 
char projectHeader[] = {"Select Project:"}; 
char* projectNames[10] = {"Quake", "Jeep", "Nikola", "Tesla", "SpaceX", "Rockford Internal", "Subaru", "Nissan", "Ducati", "Toyota"}; // TODO: chop and hardcode as appropriate structs 

char chipHeader[] = {"Select Chip:"}; // or Project Name
char* chipNames[10] = {"Atmel", "Nordic", "STM32", "Cirrus Logic", "NXP", "Renesas", "Pic32", "AVR", "Silicon Labs", "Qualcomm"}; // 

char fileHeader[] = {"Select File:"}; // or Chip Name
char* fileNames[10] = {"pickthis.bin", "promotion.bin", "Bug.bin", "this.hex", "that.bin", "banshee.bin", "pastry.elf", "killme.hex", "reget.bin", "mistakes.hex"}; 


recents_struct* recents_init(void) //TODO save recents to flash on hibernate, load on boot
{
    recents_struct* recentsX = malloc(sizeof(recents_struct));
    recentsX->file0 = NULL;
    recentsX->file1 = NULL;
    recentsX->file2 = NULL;
    return recentsX;
}


void push_file_to_recents(file_struct* file_selected) //shift recent files, pushing oldest off stack
{   
    if(file_selected != NULL && file_selected->file_name != "Empty") // file should not be null or empty 
    {   
        if((file_selected->file_name != REC_ file0->file_name) && (file_selected->file_name != REC_ file1->file_name) && (file_selected->file_name != REC_ file2->file_name)) // avoids repeats
        {   
            REC_ file2 = REC_ file1;
            REC_ file1 = REC_ file0;
            REC_ file0 = file_selected;
        }
    }
}

bool recents_check(void)
{
    if(REC_ file0 != NULL)
    {
        return true; 
    }
    else
    {
        return false;
    }
}


void clear_screen(void)
{
    SSD1351_fill(COLOR_BLACK);
    SSD1351_update();
    L_ boxPresent = false;
    L_ headerPresent = false;
}


void draw_selection_box(void) // top left corner of full width box = point (0, y) 
{
    //SSD1351_draw_rect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
    SSD1351_draw_rect(2, 48, 124, 25, COLOR_BLUE);
    SSD1351_update();
    L_ boxPresent = true; 
}


void draw_header(void)
{
    SSD1351_set_cursor(1,35);
    SSD1351_printf(COLOR_WHITE, small_font, L_ header);
    SSD1351_update();
    L_ headerPresent = true;
}


void draw_initial_screen(void)
{   
    //L_ currentList = project;
    //L_ header = projectHeader; 
    //project_name_fetch();

    L_ currentList = splash;
    L_ header = splashHeader; 
    
    L_ items[0] = "Recent Files";
    L_ items[1] = "Projects";
    recents_singleton = recents_init(); //TODO: load recents from flash 
    
    clear_screen();
    draw_selection_box();
    draw_header();
    SSD1351_set_cursor(10,57);
    SSD1351_printf(COLOR_WHITE, curr_font, L_ items[0]);
    SSD1351_set_cursor(10,83);
    SSD1351_printf(COLOR_WHITE, curr_font, L_ items[1]);
    SSD1351_update();
}


void list_clear(void)
{
    list_singleton->currentList = NULL;
    list_singleton->header = NULL;
    for(int x = 0; x < MAX_ITEMS; x++)
    {
        list_singleton->items[x] = NULL;
    }
}


list_struct* list_new(void)
{
    list_struct* listX = malloc(sizeof(list_struct)); 
    
    listX->currentList = NULL;
    listX->header = NULL;
    listX->boxPresent = false; 
    listX->headerPresent = false; 
    
    for(int x = 0; x < MAX_ITEMS; x++)
    {
        listX->items[x] = NULL;
    }
    return listX;
}


void list_init(void)
{
    list_singleton = list_new();
}


//TODO: implement set_current_project() function based on selected item, same for chip and file, render name strings only 

system_struct* system_new(void) //TODO file system, shoulf be constructed in Flash, only NAMES fetched from flash here for later display (CURRENTLY INITING WHOLE FILESSYTEM IN RAM)
{                                                            
    system_struct* systemX = malloc(sizeof(system_struct)); 
    systemX->system_name = firmware_version_fetch(); 
    systemX->projects_total = NULL;
    systemX->project_first = NULL; //project_create();
    systemX->project_curr = 0;

    return systemX;
}


uint32_t bytes_to_word(uint8_t* bytes, uint32_t word) // bytes stored MSB 
{
    word = *bytes << 24 | *(bytes + 1) << 16 | *(bytes + 2) << 8 | *(bytes + 3);

    return word; 
}


//**************************************************************  FILE FUNCTIONS  **************************************************************//

chip_struct* files_sync(int8_t selectedItem, project_struct* project_selected)
{
    chip_struct* chip_selected = chip_list_index(selectedItem, project_selected); 

    if(chip_selected->file_first == NULL)
    {
        uint16_t total_files = chip_selected->file_num;
        //total_files = 1; //NOTE FOR TEST 
        uint32_t total_file_list_size = total_files * WORD_SIZE; 

        if(total_files != 0)
        {
            //get file list 
            uint32_t file_list_address = chip_selected->file_list_addr;
            char* file_list_buffer = malloc(sizeof(char[total_file_list_size]));
            flash_read(file_list_buffer, file_list_address, total_file_list_size);

            //create first file
            uint32_t file_addr0 = *file_list_buffer << 24 | *(file_list_buffer + 1) << 16 | *(file_list_buffer + 2) << 8 | *(file_list_buffer + 3);
            char* file_buffer = malloc(sizeof(char[FILE_HEADER_SIZE]));
            flash_read(file_buffer, file_addr0, FILE_HEADER_SIZE);
            chip_selected->file_first = file_new(file_buffer, chip_selected);

            // create remainder of projects, first proejct already made 
            for(int i = 1; i < total_files; i++) 
            {   
                // convert 4 bytes into 32bit number 
                uint32_t file_addr = *(file_list_buffer + (i*4)) << 24 | *(file_list_buffer + 1 + (i*4)) << 16 | *(file_list_buffer + 2 + (i*4)) << 8 | *(file_list_buffer + 3 + (i*4));
                flash_read(file_buffer, file_addr, FILE_HEADER_SIZE);// read project data 
                file_new(file_buffer, chip_selected);
            }

            free(file_list_buffer);
            free(file_buffer);
        }
        else
        {
            chip_selected->file_first = file_create(); 
        }
    }
    return chip_selected;
}


file_struct* file_list_index(int index, chip_struct* chip_curr)  
{ 
    file_struct* fileN;
    fileN = chip_curr->file_first; 

    for(int i = 0; i < index; i++) // minus 1 loop since file_first was already factored in
    {
        if(fileN->file_next != NULL)
        {
            fileN = fileN->file_next; 
        }
        else
        {
            return NULL; 
        }
    }
    return fileN; 
}


file_struct* file_new(char* data, chip_struct* chip_curr)
{
    file_struct* fileY = file_create();

